app/controllers/articles_controller.rb

	def show
		@article.update_visits_count
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 0], ["updated_at", "2016-05-26 21:56:46.002219"], ["id", 11]]

	def new
		@article = Article.new
		@categories = Category.all
---
SELECT "categories".* FROM "categories"

	def create
		@article = current_user.articles.new(article_params)  #Esta al final lo medificamos por temas de seguridad para no sufrir ataques de injeccion of SQL
		@article.categories = params[:categories]
		if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Angel Morahw bcdb"], ["body", "nbwuibnucbeqywbcb8cbwbeciweruibwcub"], ["user_id", 1], ["created_at", "2016-05-26 20:37:54.682393"], ["updated_at", "2016-05-26 20:37:54.682393"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["article_id", 24], ["created_at", "2016-05-27 21:32:52.236722"], ["updated_at", "2016-05-27 21:32:52.236722"]]

	def update

		if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Mi primer articulo escrito desde la vista!1234"], ["updated_at", "2016-05-25 20:23:41.501196"], ["id", 11]]