app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "EcoGreen"], ["color", "#2efd00"], ["created_at", "2016-05-27 19:31:24.864012"], ["updated_at", "2016-05-27 19:31:24.864012"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save