app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 11], ["body", "mi primer comentario"], ["created_at", "2016-05-26 22:37:20.105143"], ["updated_at", "2016-05-26 22:37:20.105143"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save